### Data Manipulation

In [3]:
import pandas as pd

In [5]:
data = {'Product': ['Laptop', 'Mobile', 'Tablet', 'Monitor'],
        'Price': [1200, 800, 300, 400],
        'Units_Sold': [100, 150, 80, 60]}

In [8]:
df=pd.DataFrame(data)

In [10]:
df

   Product  Price  Units_Sold
0   Laptop   1200         100
1   Mobile    800         150
2   Tablet    300          80
3  Monitor    400          60

In [12]:
df=df.assign(Total_Revenue=df['Price']*df['Units_Sold'])

In [14]:
df

   Product  Price  Units_Sold  Total_Revenue
0   Laptop   1200         100         120000
1   Mobile    800         150         120000
2   Tablet    300          80          24000
3  Monitor    400          60          24000

In [16]:
df=df.drop(columns=['Units_Sold'])

In [18]:
df

   Product  Price  Total_Revenue
0   Laptop   1200         120000
1   Mobile    800         120000
2   Tablet    300          24000
3  Monitor    400          24000

In [28]:
df=df.rename(columns={'Price':"Unit_Price","Total_Revenue":"Revenue"})

In [30]:
df

   Product  Unit_Price  Revenue
0   Laptop        1200   120000
1   Mobile         800   120000
2   Tablet         300    24000
3  Monitor         400    24000

In [34]:
df=df.rename(index={0:"A",1:"B",2:"C",3:"D"})

In [36]:
df

   Product  Unit_Price  Revenue
A   Laptop        1200   120000
B   Mobile         800   120000
C   Tablet         300    24000
D  Monitor         400    24000

In [38]:
df=df.sort_values(by="Revenue",ascending=True)

In [40]:
df

   Product  Unit_Price  Revenue
C   Tablet         300    24000
D  Monitor         400    24000
A   Laptop        1200   120000
B   Mobile         800   120000

In [42]:
df=df.sort_index()

In [44]:
df

   Product  Unit_Price  Revenue
A   Laptop        1200   120000
B   Mobile         800   120000
C   Tablet         300    24000
D  Monitor         400    24000

In [46]:
high_revenue_data=df[df['Revenue']>30000]

In [48]:
high_revenue_data

  Product  Unit_Price  Revenue
A  Laptop        1200   120000
B  Mobile         800   120000

In [50]:
df.isnull()

   Product  Unit_Price  Revenue
A    False       False    False
B    False       False    False
C    False       False    False
D    False       False    False